---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalFileReference
source: html/ac4f0d87-ddb3-2717-535b-81352e536e80.htm
---
# ExternalFileReference Methods

Returns an absolute path to the referenced file,
 regardless of whether the PathType.Enum is relative or absolute.